==================
Infix expression with 2 integers
==================
{{ 1 + 2 }}
---

(program
    (brace_statement
        (statement
            (expression_statement
                (infix_expression
                    (plus 
                        left: (integer_literal)
                        right: (integer_literal)))))))

==================
Prefix expression
==================
{{ !true }}
---

(program
    (brace_statement
        (statement
            (expression_statement
                (prefix_expression
                    (prefix_not
                        (boolean_literal)))))))


==================
Prefix and infix expressions
==================
{{ -10 + 5 }}
---

(program
    (brace_statement
        (statement
            (expression_statement
                (infix_expression
                    (plus
                        (prefix_expression
                            (prefix_minus
                                (integer_literal)))
                        (integer_literal)))))))

==================
Dot expression
==================
{{ user.name }}
---

(program
    (brace_statement
        (statement
            (expression_statement
                (dot_expression
                    left: (identifier)
                    key: (identifier))))))

==================
Call expression with no arguments
==================
{{ "Hello World!".upper() }}
---

(program
    (brace_statement
        (statement
            (expression_statement
                (call_expression
                    receiver: (string_literal)
                    function: (identifier))))))

==================
Call expression with arguments
==================
{{ 'hello world'.split(' ') }}
---

(program
    (brace_statement
        (statement
            (expression_statement
                (call_expression
                    receiver: (string_literal)
                    function: (identifier)
                    arguments: (argument_list
                        (string_literal)))))))

