==================
Infix expression with 2 integers
==================
{{ 1 + 2 }}
---

(program 
    (brace_statement
        (statement
            (expression_statement
                (infix_expression
                    (plus 
                        left: (number_int)
                        right: (number_int)))))))

==================
Prefix expression
==================
{{ !true }}
---

(program 
    (brace_statement
        (statement
            (expression_statement
                (prefix_expression
                    (prefix_not
                        (boolean_literal)))))))


==================
Prefix and infix expressions
==================
{{ -10 + 5 }}
---

(program 
    (brace_statement
        (statement
            (expression_statement
                (infix_expression
                    (plus
                        (prefix_expression
                            (prefix_minus
                                (number_int)))
                        (number_int)))))))

==================
Dot expression
==================
{{ user.name }}
---

(program 
    (brace_statement
        (statement
            (expression_statement
                (dot_expression
                    left: (identifier)
                    key: (identifier))))))

