==================
Boolean literals
==================
{{ true; false }}
---

(program 
    (brace_statement
        (boolean_literal)
        (boolean_literal)))

==================
Array literal
==================
{{ [1, "two", false] }}
---

(program 
    (brace_statement
        (array_literal
            (integer_literal)
            (string_literal)
            (boolean_literal))))

==================
Simple string expression
==================
{{ 'Hello, world!' }}
---

(program 
    (brace_statement
        (string_literal)))

==================
Short object literal with one key
==================
{{ { name } }}
---

(program 
    (brace_statement
        (object_literal
            (pairs
                (pair
                    key: (identifier))))))

==================
Full object literal with one element
==================
{{ { name: "Serhii" } }}
---

(program 
    (brace_statement
        (object_literal
            (pairs
                (pair
                    key: (identifier)
                    value: (string_literal))))))
