==================
Inline @component without text
==================
@component('user')
---

(program
    (component_statement
        name: (string_literal)))

==================
Inline @component with short object notation
==================
@component('book', { title })
---

(program
    (component_statement
        name: (string_literal)
        argument: (object_literal
            (pairs
                (pair
                    key: (identifier))))))

==================
Inline @component with full object notation
==================
@component("user", { name: "John" })
---

(program
    (component_statement
        name: (string_literal)
        argument: (object_literal
            (pairs
                (pair
                    key: (identifier)
                    value: (string_literal))))))

==================
Block @component no arguments
==================
@component('book')
    <div>Nice</div>
@end
---

(program
    (component_statement
        name: (string_literal)
        block: (component_block_statement
            (text))))

==================
Block @component with arguments
==================
@component('book', { name })
    <div>Nice</div>
@end
---

(program
    (component_statement
        name: (string_literal)
        argument: (object_literal
            (pairs
                (pair
                    key: (identifier))))
        block: (component_block_statement
            (text))))

==================
Inline @component with block
==================
@component('book')<div>Nice</div>@end
---

(program
    (component_statement
        name: (string_literal)
        block: (component_block_statement
            (text))))
