==================
Each statement without any block
==================
@each(name in names)@end
---

(program 
    (each_statement
        var: (identifier)
        array: (identifier)))

==================
Inline each statement with 1 HTML statement
==================
@each(name in [])<span>Nice</span>@end
---

(program 
    (each_statement
        var: (identifier)
        array: (array_literal)
        block: (control_flow_block_statement
            (text))))

==================
Multiline each statement with expression
==================
@each(name in names)
    <span>{{ value }}</span>
@end
---

(program 
    (each_statement
        var: (identifier)
        array: (identifier)
        block: (control_flow_block_statement
            (text)
            (brace_statement
                (statement
                    (expression_statement
                        (identifier))))
            (text))))

==================
Each statement with escaped break
==================
@each(name in names)\@break@end
---

(program 
    (each_statement
        var: (identifier)
        array: (identifier)
        block: (control_flow_block_statement
            (text))))

==================
Each statement with multiline block
==================
@each(name in names)
    Hello
    @break
@end
---

(program 
    (each_statement
        var: (identifier)
        array: (identifier)
        block: (control_flow_block_statement
            (text)
            (break_statement)
            (text))))
